РП/src/Enums/ВидыПлатежейВГосБюджет/ВидыПлатежейВГосБюджет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыПлатежейВГосБюджет</name>
  <enumValues>
    <name>Налог</name>
  </enumValues>
  <enumValues>
    <name>НалогСам</name>
  </enumValues>
  <enumValues>
    <name>НалогАкт</name>
  </enumValues>
  <enumValues>
    <name>Штраф</name>
  </enumValues>
  <enumValues>
    <name>РасходыПоСтрахованию</name>
  </enumValues>
  <enumValues>
    <name>ПениСам</name>
  </enumValues>
  <enumValues>
    <name>ПениАкт</name>
  </enumValues>
  <enumValues>
    <name>ПолученоИзФонда</name>
  </enumValues>
  <enumValues>
    <name>НеПринято</name>
  </enumValues>
  <enumValues>
    <name>Проценты</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/ВидыПлатежейВГосБюджет/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ВидыНалоговыхПлатежей() Экспорт
	
	ВидыПлатежей = Новый Массив;
	ВидыПлатежей.Добавить(Перечисления.ВидыПлатежейВГосБюджет.Налог);
	ВидыПлатежей.Добавить(Перечисления.ВидыПлатежейВГосБюджет.НалогАкт);
	ВидыПлатежей.Добавить(Перечисления.ВидыПлатежейВГосБюджет.НалогСам);
	
	Возврат ВидыПлатежей;
	
КонецФункции

#КонецЕсли
